Revit 2024 API
View.CanViewBeDuplicated Method
 Identifies if this view can be duplicated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool CanViewBeDuplicated(
	ViewDuplicateOption duplicateOption
)
Visual Basic
Public Function CanViewBeDuplicated ( _
	duplicateOption As ViewDuplicateOption _
) As Boolean
Visual C++
public:
bool CanViewBeDuplicated(
	ViewDuplicateOption duplicateOption
)
Parameters
duplicateOption
Type: Autodesk.Revit.DB.ViewDuplicateOption
 The option to use when duplicating the view.
Return Value
 True if the view can be duplicated, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
View Class
Autodesk.Revit.DB Namespace